Tekla Open API Reference for Tekla Structures 2025
Polymesh.ToStruct Method
 Converts a
FacetedBrep
 to dotnet polymesh struct.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void ToStruct(
	ref dotPolymesh_t output
)
Public Sub ToStruct (
	ByRef output As dotPolymesh_t
)
Parameters
output
Type: dotPolymesh_t
 The output parameter.
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace